Repository: Alan86024/frequentText-
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, cs, es, pt_pt

source: Opens a dialog box to registe, manage and paste frequent blocks of text.
ar: فتح نافذة إضافة وإدارة ولصق الجمل النصية المتكررة.
cs: * Otevře dialogové okno pro registraci, správu a vkládání častých bloků textu. 1 z 32
es: Se abre un diálogo para registrar, administrar y pegar bloques de texto frecuentes.
pt_pt: Abre uma janela para registar, gerir e selecionar os blocos a colar no texto.

source: Text editing
ar: تحرير النص
cs: Úprava textu
es: Edición de textos
pt_pt: Edição de texto

source: Frequent text
ar: النصوص المتكررة
cs: Častý text
es: Texto Frecuente.
pt_pt: Texto frequente

source: Opens a dialog box with the text blocks of first or default category
ar: فتح نافذة نصوص التصنيف الأول أو التصنيف الافتراضي
cs: Otevře dialogové okno s textovými bloky první nebo výchozí kategorie
es: Abre un cuadro de diálogo con los bloques de texto de la primera categoría o de la categoría por defecto
pt_pt: Abre uma janela com os blocos de texto da primeira categoria ou da categoria padrão

source: Categories list
ar: قائمة التصنيفات
cs: Seznam kategorií
es: Lista de categorías.
pt_pt: Lista de categorias

source: &Show entries
ar: إ&ظهار المدخلات
cs: &Zobrazit položky
es: &Mostrar entradas
pt_pt: &Mostrar entradas

source: &Add
ar: &إضافة
cs: &Přidat
es: &Añadir
pt_pt: &Adicionar

source: Re&name
ar: إعادة &تسمية
cs: Přejmenovat
es: Re&nombrar
pt_pt: &Renomear

source: Set &category as default
ar: تعيين التصنيف كا&فتراضي
cs: Nastavit &kategorii jako výchozí
es: Establecer &categoría por defecto
pt_pt: Definir &categoria como padrão

source: &Remove
ar: إ&زالة
cs: &Odstranit
es: &Remover
pt_pt: &Eliminar

source: &Close
ar: إ&غلاق
cs: &Zavřít
es: &Cerrar
pt_pt: &Fechar

source: Enter a name for the category
ar: أدخل اسم التصنيف
cs: Zadejte název kategorie
es: Introoduce un nombre para la categoría
pt_pt: Introduza um nome para a categoria.

source: There is already a category with this name!
ar: يوجد تصنيف بهذا الإسم
cs: Kategorie s tímto názvem již existuje!
es: Ya existe una categoría con este nombre!
pt_pt: Já existe uma categoria com este nome!

source: Enter a new name for %s
ar: أدخل الإسم الجديد لـ %s
cs: Zadejte nový název pro %s
es: Introduce un nuevo nombre para %s
pt_pt: Introduza um novo nome para %s

source: Are you sure you want to remove %s?
ar: هل تريد إزالة %s?
cs: Opravdu chcete odstranit %s?
es: Estás seguro que quieres eliminar %s?
pt_pt: Tem a certeza que quer eliminar %s da lista de blocos?

source: Name
ar: الإسم
cs: název
es: Nombre
pt_pt: Nome

source: List of text blocks of %s category
ar: قائمة الجمل النصية لتصنيف %s
cs: Seznam textových bloků kategorie %s
es: Lista de bloques de texto para la categoría% s.
pt_pt: Lista de blocos de texto da categoria %s

source: &Paste
ar: &لسق
cs: &Vložit
es: &Pegar
pt_pt: &Colar

source: &Change blocks
ar: &تغيير الجملة
cs: &Změnit bloky
es: hacer &cambios en los bloques
pt_pt: Modificar &blocos

source: &Move
ar: &نقل
cs: &přesunout
es: &Mover
pt_pt: &Mover

source: &Back to categories
ar: العودة إلى الت&صنيفات
cs: &Zpět do kategorií
es: &Volver a las categorías
pt_pt: &Voltar a categorias

source: Enter a name for the block
ar: أدخل إسم الجملة النصية
cs: Zadejte název bloku
es: Introduce un nombre para el bloque
pt_pt: Introduza um nome para o bloco.

source: There is already a block with this name!
ar: توجد جملة نصية بهذا الإسم
cs: Blok s tímto názvem již existuje!
es: Ya existe un bloque con ese nombre!
pt_pt: Já existe um bloco com este nome!

source: Enter the block of text
ar: أكتب نص الجملة النصية
cs: Zadejte blok textu
es: Introduce el texto
pt_pt: Introduza o bloco de texto

source: Change the block of text as you want and press Tab to Ok button and Enter to confirm
ar: قم بتغيير محتوى الجملة النصية إلى ما تريد, اضغط على tab إلى زر OK, ثم اضغط Enter.
cs: Změňte blok textu, jak chcete, a stiskněte klávesu Tab na tlačítko Ok a potvrďte Enter
es: Cambie el bloque de texto como desee, presione Tab para aceptar y enter para confirmar
pt_pt: Altere o bloco de texto como quiser, pressione Tab para o botão Ok e Enter para confirmar

source: If you really want to move %s from %s category, enter the name of the new, already existing, category
ar: إذا كنت تريد نقل الجملة %s إلى التصنيف %s أدخل إسم التصنيف الذي تريد نقل الجملة إليه.
cs: Pokud opravdu chcete přesunout %s z kategorie %s, zadejte název nové, již existující kategorie
es: Si realmente desea mover %s de la categoría %s, ingrese el nombre de la categoría ya existente
pt_pt: Se realmente quer mudar %s da categoria %s, digite o nome da nova categoria já existente

source: There is no such category!
ar: هذا التصنيف غير موجود!
cs: Taková kategorie neexistuje!
es: No existe esa categoría!
pt_pt: Não existe essa categoria!

source: Check for updates at startup
ar: البحث عن التحديثات عند تشغيل NVDA
cs: Zkontrolujte aktualizace při spuštění
es: Comprobar las actualizaciones al inicio
pt_pt: Verificar actualizações ao iniciar

source: Please wait Downloading %s
es: Por favor, espere Descargando %s
pt_pt: Por favor, aguarde A descarregar %s

source: Please wait... Downloading %s
es: Por favor, espere... Descargando %s
pt_pt: Por favor, aguarde A descarregar %s

source: Update finished. You must restart NVDA for these changes to take effect. Press the Confirm button to restart or the Close to terminate without restarting
es: Actualización finalizada. Debes reiniciar NVDA para que estos cambios surtan efecto. Pulse el botón Confirmar para reiniciar o el botón Cerrar para terminar sin reiniciar
pt_pt: Actualização concluída. Deve reiniciar o NVDA para que estas mudanças entrem em vigor. Pressione o botão Confirmar para reiniciar ou o botão Fechar para terminar sem reiniciar

source: Error. Check the Internet connection and try again. You may close this window
es: Error. Compruebe la conexión a Internet y vuelva a intentarlo. Puede cerrar esta ventana
pt_pt: Erro: Verifique a ligação à a Internet e tente novamente. Pode fechar esta janela

source: Available a new version of this add-on. Do you want to download and install it now?
es: Está disponible una nueva versión de este complemento. Quieres descargarlo e instalarlo ahora?
pt_pt: Disponível uma nova versão deste extra. Deseja descarregá-la e instalá-la agora?

source: &Download and install
es: &Descargar e instalar
pt_pt: &Descarregar e instalar

source: Updating Frequent text
es: Actualización de Texto frecuente
pt_pt: A actualizar o Texto frequente

source: &Confirm
es: &Confirmar
pt_pt: &Confirmar

source: Regists blocks of text frequently used
ar: تساعدك هذه الإضافة في الاحتفاظ بالجمل النصية التي تستخدمها بكثرة
cs: Registruje často používané bloky textu
es: Rejistro de bloques usados con frecuencia
pt_pt: Regista blocos de texto frequentemente usados

source: Stores and make possible the entry of frequently used blocks of text. Command: Windows+F12.
ar: حفظ وتخزين الجمل النصية التي تستخدمها بكثرة. لفتح نافذة الإضافة, اضغط windows+f12.
cs: Ukládá a umožňuje zadávání často používaných bloků textu. Příkaz: Windows+F12.
es: Almacena y hace posible la entrada de texto usado con frecuencia. Comando: Windows+F12.
pt_pt: Armazena e torna possível a introdução de blocos de texto frequentemente usados. Comando: Windows+f12.

source: It is available a new version of this add-on. Do you want to update?
ar: يوجد إصدار جديد من هذه الإضافة. هل تريد التحديث؟
cs: Je k dispozici nová verze tohoto doplňku.\n Chcete aktualizovat?

source: This new version of this add-on is not compatible with your version of NVDA. The update process will be terminated.
ar: هذا الإصدار من الإضافة غير متوافق مع الإصدار الذي تستخدمه من NVDA. سيتم إنهاء عملية التحديث.
cs: Tato nová verze tohoto doplňku není kompatibilní s vaší verzí NVDA.\n Proces aktualizace bude ukončen.
